In [1]:
import pandas as pd

####  Series

In [2]:
s=pd.Series([56,77,33,12,66,83])

In [3]:
s

0    56
1    77
2    33
3    12
4    66
5    83
dtype: int64

In [4]:
s[2]=69

In [5]:
s

0    56
1    77
2    69
3    12
4    66
5    83
dtype: int64

In [6]:
s[5]=65

In [7]:
s

0    56
1    77
2    69
3    12
4    66
5    65
dtype: int64

In [8]:
s.size

6

In [9]:
print(s)
print("minimum value =",s.min())
###s.min()

0    56
1    77
2    69
3    12
4    66
5    65
dtype: int64
minimum value = 12

#### Dataframe

In [10]:
r=pd.Series([1,2,3,4,5])
n=pd.Series(['ajay','vijay','sameer','priya','pratap'])
m=pd.Series([10,20,30,40,50])

In [11]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [12]:
print(df)

   roll    name  marks
0     1    ajay     10
1     2   vijay     20
2     3  sameer     30
3     4   priya     40
4     5  pratap     50

In [13]:
df.size

15

In [14]:
df.shape

(5, 3)

In [15]:
df.dtypes

roll      int64
name     object
marks     int64
dtype: object

#### Read

In [16]:
import os
os.getcwd()

'd:\\projects\\Python\\VAP\\Pandas'

In [17]:
df=pd.read_csv('student.csv')
print(df)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [18]:
df.size

50

In [19]:
df.shape

(10, 5)

In [20]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [21]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [22]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [23]:
df.head(10)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [24]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [25]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

#### index based slicing

In [26]:
x=df.iloc[2:]
print(x)

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [27]:
x=df.iloc[:]
print(x)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [28]:
x=df.iloc[4:]
print(x)

   roll    name class  marks  age
4     5    asha    TE  63.28   20
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [29]:
x=df.iloc[4,:4]
print(x)

roll         5
name      asha
class       TE
marks    63.28
Name: 4, dtype: object

In [30]:
x=df.iloc[4,1:4]
print(x)

name      asha
class       TE
marks    63.28
Name: 4, dtype: object

In [31]:
x=df.iloc[[1,3,2,5,7],:]
print(x)

   roll     name class  marks  age
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
7     8    amita    BE  68.33   23

In [32]:
x=df.iloc[[3,4,5],[1,4]]
print(x)

      name  age
3  ajinkya   20
4     asha   20
5   ayesha   20

In [33]:
x=df.iloc[4,3]
print(x)

63.28

#### Label Based Slicing

In [34]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [35]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [36]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [37]:
df[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [38]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [39]:
df.drop([5,6,7])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [40]:
df.drop('class',axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [41]:
df.drop(['class','marks'],axis=1)

   roll     name  age
0     1     anil   22
1     2     amit   21
2     3   aniket   19
3     4  ajinkya   20
4     5     asha   20
5     6   ayesha   20
6     7     amar   19
7     8    amita   23
8     9     amol   20
9    10    anmol   21

#### data imports methods

In [42]:
df1=pd.read_csv('student1.csv')

In [43]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [44]:
cols=['A','B','C','D','E']
df1=pd.read_csv('student1.csv',names=cols)

In [45]:
print(df1)

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [46]:
x2=pd.read_csv('student3.tsv',sep='\t')

In [47]:
x2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

#### custom columns opertation

In [48]:
# to add data to customised columns
x =['M','M','M','M','M','M','M','F','F','F']  # gender column
df['gender']=x

In [49]:
x2['marks']+0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [50]:
df['marks']=df['marks'] +0.5
df

   roll     name class  marks  age gender
0     1     anil    TE  57.27   22      M
1     2     amit    TE  60.27   21      M
2     3   aniket    BE  77.38   19      M
3     4  ajinkya    TE  70.16   20      M
4     5     asha    TE  63.78   20      M
5     6   ayesha    BE  50.05   20      M
6     7     amar    BE  65.84   19      M
7     8    amita    BE  68.83   23      F
8     9     amol    TE  57.25   20      F
9    10    anmol    BE  79.16   21      F

In [51]:
df['cgpa']=df['marks']/10+0.37
df

   roll     name class  marks  age gender   cgpa
0     1     anil    TE  57.27   22      M  6.097
1     2     amit    TE  60.27   21      M  6.397
2     3   aniket    BE  77.38   19      M  8.108
3     4  ajinkya    TE  70.16   20      M  7.386
4     5     asha    TE  63.78   20      M  6.748
5     6   ayesha    BE  50.05   20      M  5.375
6     7     amar    BE  65.84   19      M  6.954
7     8    amita    BE  68.83   23      F  7.253
8     9     amol    TE  57.25   20      F  6.095
9    10    anmol    BE  79.16   21      F  8.286

In [52]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,57.27,60.27,77.38,70.16,63.78,50.05,65.84,68.83,57.25,79.16
age,22,21,19,20,20,20,19,23,20,21
gender,M,M,M,M,M,M,M,F,F,F
cgpa,6.097,6.397,8.108,7.386,6.748,5.375,6.954,7.253,6.095,8.286

#### connect

In [53]:
# merge,join,concat,append

In [54]:
ndf=pd.DataFrame({
    'roll' :range(1,11),
    'gender':['M','M','M','M','M','M','M','F','F','F'] ,
    'cgpa':df['marks']/10+0.37



})

In [55]:
ndf

   roll gender   cgpa
0     1      M  6.097
1     2      M  6.397
2     3      M  8.108
3     4      M  7.386
4     5      M  6.748
5     6      M  5.375
6     7      M  6.954
7     8      F  7.253
8     9      F  6.095
9    10      F  8.286

In [56]:
df = pd.read_csv('student.csv')
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [57]:
ndf.columns

Index(['roll', 'gender', 'cgpa'], dtype='object')

In [58]:
df.merge(ndf,on ='roll')

   roll     name class  marks  age gender   cgpa
0     1     anil    TE  56.77   22      M  6.097
1     2     amit    TE  59.77   21      M  6.397
2     3   aniket    BE  76.88   19      M  8.108
3     4  ajinkya    TE  69.66   20      M  7.386
4     5     asha    TE  63.28   20      M  6.748
5     6   ayesha    BE  49.55   20      M  5.375
6     7     amar    BE  65.34   19      M  6.954
7     8    amita    BE  68.33   23      F  7.253
8     9     amol    TE  56.75   20      F  6.095
9    10    anmol    BE  78.66   21      F  8.286

In [59]:
df5=pd.read_csv('student5.csv')
print(df5)

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [60]:
pd.concat([df,df5],ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

#### Methods or functions

In [61]:
df['marks'].mean()

64.499

In [62]:
df['marks'].max()

78.66

In [63]:
df['marks'].min()

49.55

In [64]:
df['marks'].sum()

644.9899999999999

In [65]:
df['marks'].median()

64.31

In [66]:
df['marks']

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [67]:
df['marks'].std()

9.207178901994535

In [68]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [69]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [70]:

df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [71]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [72]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [73]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [74]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [75]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [77]:
df.median(numeric_only=True)

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [78]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

#### String Operation

In [79]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [80]:
df['name'].str.lower()

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [81]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [82]:
df['name'].str.swapcase()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [83]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [84]:
df['name'].str.replace('a','b')

0       bnil
1       bmit
2     bniket
3    bjinkyb
4       bshb
5     byeshb
6       bmbr
7      bmitb
8       bmol
9      bnmol
Name: name, dtype: object

In [85]:
df['name'].str.count('[a]')

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [86]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [87]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

#### Grouping operation

In [88]:
gr= df.groupby('class')

In [89]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [90]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [91]:
gr.agg(sum)

       roll                        name   marks  age
class
BE       34  aniketayeshaamaramitaanmol  338.76  102
TE       21     anilamitajinkyaashaamol  306.23  103

In [92]:
gr.agg(min)

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [93]:
gr.agg(max)

       roll    name  marks  age
class
BE       10  ayesha  78.66   23
TE        9    asha  69.66   22

Boolean filtering

In [94]:
mask=df['marks']>60

In [95]:
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [96]:
x=df[df['marks']>60]
x

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [97]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [98]:
x=df[(df['marks']>=60) & (df['class']=='BE')]

In [99]:
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21